tutorials/darcyFoam-tutorials/phreeqcRM/Calcite_disso_kinetic/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         3000;

deltaT          1e-1;

writeControl    runTime;

writeInterval   600;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6

runTimeModifiable true;

maxCo 1.5; // Or other Courant number you wish

adjustTimeStep no; // Or no

maxDeltaT 1e-1; // Maximum deltaT in seconds

//libs ( "/usr/local/lib/libphreeqcrm-3.6.2.so" );

// ************************************************************************* //
