tutorials/darcyFoam-tutorials/phreeqcRM/Calcite_disso_kinetic/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    right
    {
        type            patch;
        nFaces          1;
        startFace       49;
    }
    inlet
    {
        type            patch;
        nFaces          1;
        startFace       50;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          200;
        startFace       51;
    }
)

// ************************************************************************* //
