tutorials/darcyFoam-tutorials/phreeqcRM/Calcite_disso_kinetic/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
	\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

//nu 1e-3;

mu              mu [ 1 -1 -1 0 0 0 0 ] 1e-3;

rho             rho [ 1 -3 0 0 0 0 0 ] 1000;



geochemicalProperties
{
	basicGeochemicalModel phreeqcRM;

	mineral (Calcite);

	absolutePermeabilityModel heterogeneousScalarConstant;
	heterogeneousScalarConstantCoeffs
	{
		K0      K0 [ 0 2 0 0 0 0 0 ] 1e-11;
	}

	CalciteProperties
	{
		activatePhaseEquilibrium	false;
		rhos   rhos [ 1 -3 0 0 0 0 0 ] 2707;	
		Vm     Vm   [ 0 3 0 0 -1 0 0 ] 36.9e-6;		// 36.9 cm3/mol
		surfaceAreaModel constantSurfaceArea;
		constantSurfaceAreaCoeffs
		{
			A0 A0 [0 -1 0 0 0 0 0] 1.5e6;
		}
	}

	phreeqcRM
	{
		PhreeqcInputFile "phreeqcInput";
		PhreeqcDataBase  "phreeqc.dat"; //"phreeqc.dat";

		activateUpdatePorosity false;

		Di   		Di  [0 2 -1 0 0 0 0] 1e-9;
		alphaL   alphaL [0 1 0 0 0 0 0] 0.005;
	}

}












// ************************************************************************* //
